Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Metro Hunter.tmx
Source language: ko_kr
Languages: en_us

source: 지페리는
en_us: zipherie was...

source: 끙차
en_us: grunt

source: 르르
en_us: burble

source: 일순간 엄청난 혼란이 왔지만
en_us: ...and though there was a big commotion at first...

source: ···아니요.
en_us: no...

source: 지옥에서 직접 물어보지 그래?
en_us: ...why not go ask him yourself in hell?

source: 자···.
en_us: here...

source: 너 마족이었냐?
en_us: are you a demon?

source: 랭커들 중에도 몇 없는 희귀한 능력이야.
en_us: it’s a rare ability even among rankers.

source: 이 묵직하고 서늘한 감각!
en_us: there’s no mistaking this weight and edge!

source: 저놈입니다.
en_us: it’s him.

source: 뽈칵
en_us: pop

source: 이해가 안 된다는 표정이군ꞏꞏꞏ.
en_us: your face is telling me you don’t understand...

source: '감바스'
en_us: gambas

source: 고맙다!
en_us: thanks!

source: 모락
en_us: steam

source: 교주님께 무례하게 굴지 마.
en_us: don’t go disrespecting the elder.

source: 크윽
en_us: ugh

source: 한 번 더 염구를 날려 낙하 속도를 줄일 수 있었을 텐데···.
en_us: ...I could release another fire ball and slow my fall...

source: 다시 한번 묻겠다.
en_us: I will ask you again.

source: 투둑
en_us: splatter

source: 이곳에 내려주지.
en_us: I’ll let you down here.

source: 아!!
en_us: ah!!!

source: 그렇다면 레벨은?
en_us: and its level is?

source: 강철은 눈 앞의 적에게 언제든 검을 휘두를 수 있었지만,
en_us: cheol kang could swing his sword at the enemy whenever he wanted...

source: 이게 파도의 주인이라고?
en_us: That’s the Master of Waves?

source: 뭐여?!
en_us: what’s going on here?!

source: 녀석과는···.
en_us: zipherie and I...

source: 오크와의 전투 강좌 세 번째!
en_us: lesson number three of fighting orcs!

source: 길드 마스터
en_us: guildmaster

source: 뭐 하는 짓입니까?
en_us: what are you doing?

source: '다인 슬라이프'
en_us: dain sleif

source: 타탓
en_us: dart

source: 뱀파이어 로드 지페리.
en_us: the vampire lord zipherie.

source: 전설
en_us: legendary

source: 네!{j}스승님!
en_us: yes, master!{j}

source: 키메라도 없어진 마당에 무슨 수로 나를 상대할 생각이지?
en_us: and how are you planning on facing me now that the chimera’s gone?

source: 근데 한 번만 봐줄게.
en_us: but I’ll let you off this once.

source: 후우···
en_us: whew...

source: 느릿
en_us: slow

source: 초월
en_us: transcendence

source: 너, 파도의 주인의 노예였나?
en_us: you’re the Master of Waves’s slave?

source: 강철!
en_us: cheol kang!

source: 빨리!!
en_us: quickly!

source: 쿨럭
en_us: cough

source: 주인의 힘?
en_us: master?

source: 천 평 가방!
en_us: 30 thousand square-foot bag...!

source: 서울의 영웅을 어찌 모를 수 있겠습니까!
en_us: how could I not know the hero of seoul?!

source: 보스 몬스터라도 잡으셨어요?
en_us: did you take out a boss monster or something?

source: 동료가 죽는 걸 구경만 한 거냐?
en_us: ...to get your hands on a monster like that?

source: 쿠우
en_us: glare

source: 뱀파이어 로드 지페리여.
en_us: hear me, vampire lord zipherie.

source: ꞏꞏꞏ더 이상 설명할 시간이 없다.
en_us: but there is no time to explain.

source: 가닥이 더?!
en_us: more hair?!

source: 썩어 넘칠 정도로 많다구!
en_us: ...I’ve got a horde of them!

source: 네?
en_us: what?

source: 하루종일 촉촉하게!
en_us: all-day moisturizing!

source: 끄으으
en_us: urgh.

source: 이건 엄청 무식한 방법으로 만든 검이니까.
en_us: the way to make this blade is highly unsophisticated.

source: 아직 묻고 싶은 게 남아 있ꞏꞏꞏ.
en_us: but I still have questions--

source: 우리 열차는 그 틈을 비집고 마계와 인간계를 오가는 특급 열차합니다.
en_us: our high-speed train squeezes through this space to travel between the demon and human realms.

source: 정신까지 깨어나게 하려면,
en_us: in order for the master to gain consciousness,

source: 길드 창고에 보관 중인 포션들을 모두 가져오세요!
en_us: bring me every last potion in the guild’s storage room!

source: 버럭
en_us: yell

source: 난리 났군.
en_us: this is a mess.

source: 왕호.
en_us: wang ho.

source: 초대 용사.
en_us: the first warrior.

source: 기분은 잘 모르겠고
en_us: now I don’t know about that...

source: 그러니까 적당히 깝치지 왜 이렇게 나대셨어요···?
en_us: now, why’d you have to cross the line and piss me off...?

source: 아무래도
en_us: it looks to me...

source: 쐐액
en_us: whish

source: 타닥
en_us: crackle

source: 강남역 사태가 재현되는 거다!
en_us: it will be the gangnam station incident all over again!

source: 최종적으론 하나의 표적을 향해 날아간다.
en_us: ...but in the end, they all fly toward a single target.

source: 못생겨서 몬스터인 줄 알았잖아?
en_us: you’re so ugly that I thought you were a monster.

source: 자신의 야망과는 다르게
en_us: unlike her own ambitions...

source: 초대 용사 왕호를 찾아라.
en_us: ...look for the first warrior, Wang Ho.

source: 단장ꞏꞏꞏ.
en_us: commander...

source: 세간에 알려지지 않은 이유가 있었군요!
en_us: it makes sense why the public doesn’t know about it!

source: 물방울 길드의 교주 김택이 죽었습니다.
en_us: the elder of the waterdrop guild, taek kim, is dead.

source: 키엑
en_us: skree

source: 카악!
en_us: grahhh!

source: 마계 서열 2위
en_us: demon realm rank 2

source: 젠장!
en_us: crap!

source: 다른 헌터들이 따라 하지 못하는 이유가 있었군.
en_us: so this is why other hunters couldn’t recreate them.

source: 상대를 흥분시켜라!
en_us: make your opponent lose their cool!

source: 지금도 이렇게 정중하게 부탁하고 있지 않겠어?
en_us: ...I’m going to ask you very politely for a favor.

source: 직접 확인해 보는 수밖에.
en_us: I will just have to confirm it with my own eyes.

source: 랭커 7위
en_us: rank 7

source: 끼익
en_us: creak

source: 끝이 없군.
en_us: ...there’s no end to them.

source: 털썩
en_us: thud

source: 쿠가 축복자인 오크에 문어 머리 인간!
en_us: an orc blessed by kuga and a human with a head like an octopus’s!

source: 그런 느려터진 화살이 내 몸에 닿을 수 있을 것 같냐?
en_us: did you think these slow-as-hell arrows would even touch me?

source: 랭킹 19위인 교주의 펀치를 막았어?
en_us: did he just block a punch from the 19th place ranker?

source: 카악!!
en_us: grahh!!

source: 도움
en_us: Assistants

source: 그대는 충분히 실력과 가치를 증명 해냈어.
en_us: you’ve done more than enough to demonstrate your skill and worth.

source: 후드득
en_us: thump

source: 22시간 22분 후에 열차가 도착합니다.
en_us: the next train will arrive in 22 hours and 22 minutes.

source: 카핫
en_us: keke

source: 보기완 다르게 쪼잔한 녀석이네.
en_us: you’re stingier than you look.

source: 뭐야 이건?!
en_us: what is this thing?!

source: 그 녀석, 하늘도 날 수 있는 거냐?
en_us: that thing can fly?

source: 지페리가 방해하지 않는다면
en_us: if zipherie doesn’t get in the way...

source: 환이 너.
en_us: hwan.

source: 드륵
en_us: roll

source: 나를 부른 자 누구인가?
en_us: who summoned me?

source: 어림없는 소리!
en_us: not a chance!

source: 쩍
en_us: whoosh

source: 차원의 문을 열어라.
en_us: open the gate between our worlds.

source: 첫 번째는 저의 아버지.
en_us: the first is my father.

source: 화{j}악
en_us: slash

source: 쿠우우
en_us: blaze

source: 야만족 수장
en_us: barbarian chief

source: 그렇다면 잘 찾아온 게요!
en_us: then lad, you’ve come to the right place!

source: 그렇다면 말이 좀 통하겠구먼.
en_us: then this will be easier than I thought.

source: 모든 것을 가진다는 것이다!
en_us: ...takes everything!

source: 꽈득
en_us: clench

source: 이 육중한 몸으로 그런 게 가능할 리 없지요!
en_us: obviously something this heavy could never!

source: 이참에 빨리 제거하시고
en_us: you should get rid of them fast...

source: 당신도 마찬가지 아닌가요?
en_us: are you not the same?

source: 안내
en_us: receptionist

source: 식구가 늘어나서 조금 당겨 쓴 거 뿐이라고
en_us: I just took a little in advance since our numbers grew!

source: 가드가 비어서···.
en_us: these holes in your defense...

source: 그 오크 블레이드.
en_us: that orc blade...

source: 랭커 32위
en_us: rank 32

source: 안녕?
en_us: what’s up?

source: 노안까지 와버렸지 뭐야!
en_us: I’ve even gone farsighted in my old age!

source: 가방을 열어다오.
en_us: open the bag for me.

source: 서열 2위가 누구지?
en_us: who’s next in line?

source: 저릿
en_us: twinge

source: 콰{j}콰{j}쾅
en_us: kaboom

source: 사사건건 길드 일에 훼방을 놓을 땐 언제고,
en_us: it seems like it was only yesterday that you were meddling with the guild’s affairs...

source: 길드마스터
en_us: guildmaster

source: 콰직
en_us: crunch

source: 쿠가의 종과 지페리가 손을 잡는다고?
en_us: kuga’s slave and zipherie are joining forces?

source: 키워보고 싶었는데ꞏꞏꞏ.
en_us: I wanted to keep him as as a pet...

source: 너는 화염의 주인을 이 세계에 불러올 생각이냐?
en_us: do you intend to summon the master of flames into this world?

source: 오합지졸일 뿐이라고!
en_us: ...are just a bunch of rabble!

source: 일곱 개의 세계를 관리하는 수호자들이다.
en_us: ...the guardians who oversee the seven realms.

source: 마음에 빈틈이 많을수록 마인드 컨트롤이 미치는 효과는 상승하지요.
en_us: mind control becomes more effective as the openings in a person’s mind increase.

source: 뭐긴 뭐야?
en_us: what do you mean?

source: 오크검술
en_us: orc sword art

source: 슈{j}아{j}아
en_us: swoosh

source: 아작
en_us: munch

source: 오히려
en_us: I’m actually...

source: 제길.
en_us: damn.

source: 무려 인간의 5배에 육박한다고 한다.
en_us: ...nearly five times that of a human’s.

source: 혼자서 전부 상대할 수 있겠냐?
en_us: you think you can take us all on at once?

source: 지하 주점
en_us: underground bar

source: 왁
en_us: whoosh

source: 오크가 이 검을 준다는 건 전사로 인정하다는 뜻이라고!
en_us: if an orc gives you their blade, it means they’ve acknowledged you as a warrior!

source: 몰라.
en_us: I don’t know.

source: 더 좋은 것?
en_us: something better?

source: 그렇다면 돈을 줄게!
en_us: then I’ll pay you!

source: 그 어떤 감정도 느껴지지 않아.
en_us: ...from you.

source: '쿤'
en_us: khun

source: 살려서 데려갈 가치가 없어!!
en_us: ...yer not worth bringing in alive!!

source: 우당탕
en_us: tumble

source: 네놈이 그럴 자격이 있는 존재라는 걸!
en_us: prove to me that you are qualified to do this!

source: 너무 높은 곳에서 떨어졌어!
en_us: he fell from way too high up!

source: 콰 콰 콰
en_us: whoosh

source: 와작
en_us: crunch

source: 번쩍
en_us: spark

source: 으아아아아!!
en_us: aaah!

source: 너무 들이대지 말라고.
en_us: don’t come too close.

source: 오크 전사
en_us: orc warrior

source: 우리만 있을 줄 알았는데 다른 승객도 있네요?
en_us: I thought we were the only ones here but it looks like there are other passengers.

source: 이번 전투, 쉽지 않았다고 들었습니다.
en_us: I heard it was a tough battle.

source: 이봐.
en_us: look here.

source: 뭐야?
en_us: What is this?

source: 잘못된 주인을 선택한 벌이다!
en_us: ...your punishment for choosing the wrong master!

source: 이 자식이!!!
en_us: you little!!!

source: 나쁘지 않은데?
en_us: that’s not a bad deal.

source: 그래!
en_us: that’s right!

source: 마나 스톤 말고 다른 것도 먹여서 키우는 것 같던데?
en_us: you feed it other things besides mana stones, don’t you?

source: 열차를 보는 것조차 쉽지 않지.
en_us: ...so it’s hard to even catch a glimpse of it.

source: 손수 정리하시지 않으셨습니까!
en_us: and you personally disposed of them all!

source: 아직 언노운을 공략한 헌터가 단 한 명도 없을 정도로 위험해.
en_us: unknowns are so dangerous that not a single hunter has been able to defeat one.

source: 파
en_us: rush

source: 강철은 전투를 망설일 수밖에 없었는데ꞏꞏꞏ.
en_us: cheol kang naturally hesitated to fight...

source: 축복자일 확률이 높다.
en_us: ...which means there’s a high chance he’s blessed.

source: 둘이 친한 거 아니었어?
en_us: they weren’t friends?

source: 그냥 겁대가리를 상실한 겁니까?
en_us: ...or are you just a fool?

source: 나와 계약한 건 마계의 왕 올드원.
en_us: my contract is with the old one, the demon realm’s king.

source: 움직일수록 더욱 깊게 파고들고 있어.
en_us: ...they sink deeper the more I move.

source: 스승님!
en_us: master!

source: 카드득
en_us: skiiid

source: 추하군.
en_us: you’re a disgrace.

source: 그럼 잘 가시게.
en_us: then, farewell.

source: 잡았다!
en_us: I’ve got you!

source: 아주 심보가 고약합니다!
en_us: a real piece of work, that one!

source: 불타는 검이라니··· 완전 주인공 같으십니다.
en_us: with your flaming sword... you look just like the hero in a story, sir.

source: 네, 알고 싶어요.
en_us: yeah, I do.

source: 너도 알지?
en_us: you know...

source: 여기 있습니다.
en_us: here you go,

source: 울컥
en_us: urgh

source: 당신도 축복자인가 보군요.
en_us: it seems you are one of the blessed as well.

source: 하지만 파도의 주인이 육체를 거치게 되면
en_us: but when they pass through the Master of Waves’s body...

source: 축복자의 탑승으로 열차가 출발할 명분은 충족되었으니까요.
en_us: the train's all set to depart as long as there are blessed ones on board.

source: 부탁하는 주제에 예의 없게 굴진 않았으면 좋겠군요.
en_us: I would prefer if you weren’t so rude when you’re the one asking for a favor.

source: 스승님!!
en_us: master!!

source: 대체 무신 꿍꿍이여?
en_us: what are yeh up teh?

source: 정복자 쿠가의 노예구나!
en_us: you’re the slave of kuga the conqueror!

source: 그동안 즐거웠네.
en_us: it was fun while it lasted...

source: 타 앗
en_us: dash

source: 빠
en_us: smash

source: 네놈이었을 줄이야.
en_us: who could’ve thought?

source: 콰 직
en_us: crush

source: 익숙해.
en_us: I’m used to it.

source: 어서 오세요!
en_us: Commander.

source: 인간계는 주인이 있어서는 안되는 곳이다.
en_us: the human world is no place for a master.

source: 이보다 다루기 쉬운 장난감은 없다 이겁니다.
en_us: to put it simply, there’s no toy easier to control!

source: 강철.
en_us: cheol kang.

source: 태산전자 주가가 오를 거니까 전 재산 박아 넣으라고 하시던데?!
en_us: to invest all of my savings in taesan electronics because their stocks are about to explode!

source: 회복 속도보다
en_us: his body is breaking down at a faster rate...

source: 힘내 보는 거야!
en_us: let’s do this!

source: 개수작
en_us: stop playing...

source: 후웅
en_us: fling

source: 한낱 오크 따위의 공격이 통하겠냐?
en_us: you think a mere orc could even scratch him?

source: 어떻게 된 일인진 잘 모르겠지만,
en_us: I’m not sure what’s going on exactly...

source: 탓
en_us: drop

source: 49화
en_us: episode 49

source: 너는?
en_us: you’re...?

source: 진짜 무서운 건 그런 무법자들을 힘만으로 굴복시킨 남자.
en_us: ...the really scary one is the guy who got those outlaws to submit to him through sheer strength.

source: 다크 보이
en_us: dark boy

source: 어
en_us: bellow

source: 당장 내일 쫑 날지도 모르는 인생인데.
en_us: I could be dead tomorrow, for all I know.

source: 같이 가요!
en_us: wait for us!

source: 정말 그곳이 배후라면
en_us: if they’re truly the masterminds behind this...

source: 얼마면 돼?
en_us: how much is it?

source: 가방이나 열어.
en_us: now, open the bag.

source: 탕
en_us: crash

source: 툭
en_us: clang

source: 열차가 파괴되면 우린 영원히
en_us: if this train is destroyed...

source: 그래도 이 정도면···.
en_us: but with this...

source: 1 출입구
en_us: 1 Gate

source: 성기사
en_us: holy knight

source: 찰랑
en_us: slosh

source: 화룡의 둥지
en_us: the fire dragon’s nest

source: 물론입니다.
en_us: of course.

source: 너의 무덤이 될 테니까.
en_us: ...will be your grave.

source: 어서 오세요.
en_us: welcome,

source: 할 수 있겠어?
en_us: do you think you can do it?

source: 여긴 어떻게 알고 오셨어요?
en_us: how’d you know I was here?

source: 쿠당
en_us: whabam

source: 챙
en_us: shing

source: 흥ꞏꞏꞏ.
en_us: hmph...

source: 쿠구
en_us: rumble

source: 파닥
en_us: flap

source: 이대웅
en_us: Dae-ung Lee

source: 높은 연봉에 보장된 명예를 내팽개치고,
en_us: to think he would throw aside riches and honor,

source: 뭐야?!
en_us: What the hell?!

source: 나쁘지 않군.
en_us: it’s not a bad feeling.

source: 난 믿지 않았지.
en_us: ...but I didn’t believe it.

source: 이제 안전하니까 나와!
en_us: it’s safe for you to come out now!

source: 자격이 없는 자가 주인의 육체를 가지게 된다 한들
en_us: even if someone who has no right to it gets the body of a master...

source: 꼴사납게 굴긴ꞏꞏꞏ.
en_us: gross...

source: 겨우 그게 다요?
en_us: that’s it?

source: 둘이라고 한 적 없는데?
en_us: I never said it was only us two, you know?

source: 규율을 깨고 불러온다면
en_us: if you break the rules and summon one...

source: 마음것 떠들어봐.
en_us: keep prattling.

source: 애타게 찾던 그 물건을 넘겨주지.
en_us: ...I’ll give you that item you’ve been desperately searching for.

source: 10년이 지났는데ꞏꞏꞏ.
en_us: it’s been ten years...

source: 끄아아악!!
en_us: arghhh!!

source: 대답을 못하는 걸 보니 사실인가 보군.
en_us: I am right, since you fail to answer.

source: 초월의 경계에 다다른 걸 보니
en_us: since you’ve achieved transcendence...

source: 감바스가 아니다.
en_us: it’s not gambas.

source: 어때.
en_us: so,

source: 욱신
en_us: throb

source: 파도의 주인이여 저 불온한 인간을 먹어치우세요!
en_us: Master of Waves, devour that defiant mortal!

source: 키잉
en_us: flash

source: 싸우는데 쓰는 것보단
en_us: than wasting it on fighting...

source: 콰당
en_us: crash

source: 서쪽 마계
en_us: western demon realm

source: 제발 살려줘!
en_us: please don’t kill me!

source: 빠득
en_us: crack

source: 그런데 ···.
en_us: but...

source: 시몬이랑 닮은 이 친구는 누구예요?
en_us: who’s this sheamon-looking kid?

source: 불꽃을 밟고
en_us: he launched himself off of...

source: 꽈드득
en_us: squeeze

source: 인간계는 우리가 모르던 곳이었다.
en_us: we were unaware that the human realm existed.

source: 스승님께 실력 좋은 대장장이라고 전해들었어요!
en_us: my master told me you were a skilled blacksmith!

source: 공격대장
en_us: attack general

source: 축복자에게 나눠준 나의 마나.
en_us: I am taking back the mana I gave to you, my blessed.

source: 쿠가라면···.
en_us: kuga...

source: 손날 만으로 오버로드를 제압하시다니ꞏꞏꞏ.
en_us: you took down an overlord with your bare hands...

source: 어떻게, 식사는 하셨습니까?
en_us: have you eaten yet?

source: 딱 보면 모르겠냐?
en_us: isn’t it obvious?

source: 공허의 왕
en_us: king of the void

source: 화 악
en_us: whoosh

source: 쿠 오
en_us: loom

source: 그러니 주제넘지만, 부탁 하나만 드려도 될까요?
en_us: so I know I’m being forward, but could I ask you a favor?

source: 어쩐지 대화가
en_us: I have a feeling...

source: 싹
en_us: rub

source: 일단
en_us: well, for starters...

source: 담배
en_us: cigarettes

source: 통상적으로 알려진 오크의 근력은
en_us: in general, an orc’s physical strength is said to be...

source: 무슨?!
en_us: what?!

source: 나아가서는 그 힘을 사용할 수 있다는 의미도 된다.
en_us: ...and that you can even use their power.

source: 당신···.
en_us: you...

source: 몬스터가 먼저 공격하는 일은 없을 거다.
en_us: you don’t have to worry about monsters attacking us first.

source: 여긴 내가 원해서 온 곳이 아니야.
en_us: I did not come here because I wanted to...

source: 당신의 IQ는 한 자릿수일 가능성이 높다.
en_us: ...it’s highly likely that your iq is in the single digits.

source: 있는 힘껏 내려치긴 했지만
en_us: I struck at max power...

source: 밤 구름 길드 사무소
en_us: office of the night cloud guild

source: 그래도 돌파구가 아예 없는 건 아니지.
en_us: still, I’m not completely stuck.

source: 크아악!
en_us: graaah!

source: 잉?
en_us: what, lad?

source: 이건 진짜 사기 템인데?
en_us: that’s actually overpowered.

source: 불 광
en_us: bulgwang

source: 덕분에 물방울 길드의 신도들은 무사히 깨어날 수 있었고
en_us: as a result, the believers were able to regain consciousness...

source: 하지만 스승님은 마나가 고갈되신 상태 아닌가요?
en_us: but isn’t your mana depleted, master?

source: 워터 보이즈
en_us: water boys

source: 내가 볼 때 네놈은!!
en_us: ...but the way I see it...

source: ㅆ발 이게 대체 무슨 일이야?!
en_us: what the f*ck is going on here?!

source: 타앗
en_us: leap

source: 므아아아아!!!
en_us: graaah!!!

source: 됐고.
en_us: okay, whatever.

source: 오버로드
en_us: overlord

source: 아버지는 잘 계시고
en_us: and how is he?

source: 키메라가 당했습니다!!
en_us: the chimera’s down!

source: 이 은혜.
en_us: someday, we’ll repay you for this...

source: 앗
en_us: fwoosh

source: 아ꞏꞏꞏ 알겠습니다!
en_us: u-understood!

source: 강철 님이 네 지도를 부탁하셨거든.
en_us: cheol kang asked me to be your teacher.

source: 그 녀석 자체가 피닉스의 눈과 융합해버린 거다.
en_us: he fused together with the phoenix eye.

source: 우리 이제 그럼 어디로 가요?
en_us: where are we going now?

source: 그런데 어째서 저렇게 여유로운 거지?
en_us: so how can he be so relaxed?

source: 초대 용사 '왕 호'
en_us: first warrior wang ho

source: 앉으세요.
en_us: then please, have a seat.

source: 덜그럭
en_us: clatter

source: 응!
en_us: okay!

source: 아직 끝나지 않았으니까!
en_us: ...because it’s not over yet!

source: 귀엽네?
en_us: how adorable.

source: 학
en_us: slash

source: 나의 분신들아.
en_us: ...my clones.

source: 들키지 않고 몰래 활동하는 게 편했는데
en_us: working behind the scenes was nice...

source: 과연 전부 다 피할 수 있을까?
en_us: will he really be able to dodge all of them?

source: 레벨 60의 폴른 엔젤을 통솔할 수 있을 정도의 고등한 존재가 기다리고 있는 건가?
en_us: ...is a superior being capable of commanding level 60 fallen angels?

source: 콰 쾅
en_us: sizzle

source: 파{j}캉
en_us: clang

source: 마계는 지금 비어있는 왕좌를 두고 싸우는 마족들의 전쟁터.
en_us: the demon realm right now is a battlefield with the demons fighting over the empty throne.

source: 대화만 몇 마디 나누고 돌아가 줄 테니까.
en_us: I just want a word with them, and then I’ll be out of your hair.

source: 엉
en_us: crash

source: 받아주지!
en_us: I’ll take you on!

source: 블레이즈 스핀
en_us: blaze spin

source: 그리고 물방울 길드까지.
en_us: and now, the waterdrop guild.

source: 함부로 입을 놀려대는 걸 보니···.
en_us: if you can still shoot your mouth off...

source: 흥정 그만해!
en_us: stop with the haggling!

source: 쾅
en_us: bam

source: 인간계를 정복하러 간다.
en_us: ...conquer the human world.

source: 막거리나 같이 먹자고 온 건 아니잖아?
en_us: you’re not only here to drink rice wine with me, right?

source: 우린 곧바로 던전으로 내려갈 거니까.
en_us: we’ll be going into a dungeon soon anyway.

source: 벌컥
en_us: gulp

source: 아쿠아
en_us: aqua

source: 이게 진짜 헌터끼리의 싸움이 맞아?
en_us: is this really a fight between two hunters?

source: 오래된 이야기에 끝맺음을 내고 싶어서.
en_us: I wanted to put an end to this old story.

source: 챙강
en_us: snap

source: 오아시스
en_us: oasis

source: 멍청한 놈!
en_us: you fool!

source: 고급 기술?
en_us: a sophisticated technique?

source: 화
en_us: whoosh

source: ㅋㅋ
en_us: hehe

source: 언젠가 다시 돌아오고 말테니까!
en_us: ...I’ll be back someday!

source: 언제 내가 상대한대?
en_us: who said I’d be the one to face you?

source: 뭔데 이 상황?
en_us: what’s going on?

source: 쉽지 않을 텐데?
en_us: it won’t be easy, you know.

source: 그리고 아자토스의 아들까지!
en_us: plus azatos’s son!

source: 슈우
en_us: gleam

source: 날 불러낸 건 네 힘이 아니라
en_us: it wasn’t your power that summoned me...

source: 언제 품으로 파고 들었지?
en_us: when did he get under my nose?

source: 부그르륵
en_us: burble

source: 한 번에 전부 먹어 버린다!
en_us: I’ll take all of them at once!

source: 내가 이렇게 싹싹 빌게ꞏꞏꞏ.
en_us: I’m begging you...

source: 닥쳐.
en_us: shut up.

source: 중력을 이용한 가속도를 얻기 위함!
en_us: ...was to use gravity to accelerate!

source: 하··· 참.
en_us: haa... jeez.

source: 내 힘의 한계가
en_us: ...and see...

source: 투쟁을 두려워하는 겁쟁이였을 줄이야.
en_us: ...was a coward in the face of battle?

source: 이제 만들지도 못하는 포션을 이만큼이나?
en_us: this many potions? when we can’t even make them any more?

source: 두둥
en_us: da dun

source: 들켜버렸네?
en_us: oops, you found me out.

source: 이곳은 서열이 정리된 곳이니까
en_us: this place has an established pecking order.

source: 이럴 때 난 어떻게 해야···.
en_us: what am I supposed to do in times like these...

source: 폴른 엔절!
en_us: fallen angels!

source: 더···.
en_us: more...

source: 콱 콱
en_us: whoosh

source: 형님!
en_us: hyeongnim!

source: 그녀의 목숨을
en_us: I’ll give you...

source: 전투의 흐름을 이끌어가야 해.
en_us: ...and take control of the flow of this battle.

source: 아{j}아
en_us: whoosh

source: 강철 그놈에게 원한을 가진 마족을 만날 줄이야.
en_us: who could’ve imagined we’d come across a demon with a grudge against cheol kang?

source: 파바박
en_us: duck

source: 어디서 말대답이야!
en_us: where do you get off talking back like that!

source: 하지만 ···.
en_us: but...

source: 베도 베도
en_us: no matter how many I cut down...

source: 꾸드득
en_us: plunge

source: 물방울 기사단 단장 함필규.
en_us: Knight Commander of the Waterdrop Guild Pilgyu Ham reporting...

source: 중얼
en_us: mumble

source: 마4 갈매기
en_us: mapo4 seagull

source: 쪼잔한 놈.
en_us: you’re a stingy one.

source: 메트로 헌터
en_us: metro hunter

source: 52화
en_us: episode 52

source: 올드원을 죽인 것도 너냐?
en_us: was it you who killed the old one, then?

source: 제일 좋은 건 좀 비싼디 지불하실 수 있으실랑가 모르겠네~
en_us: I don’t know if you’ll be able to afford it. my best item is a little expensive, see!

source: 오늘 하루는 더럽게 재수 없는 날이다.
en_us: today isn’t my day.

source: 컵밥
en_us: cup rice

source: 이 애송이들 꼭 데리고 가야 하는 겁니까?
en_us: do we really have to bring these little kids with us?

source: 도벌에 놀아나고 있던 건 나였나 보군.
en_us: it looks like I let myself get provoked.

source: 밤 구름 길드의 공격대장 감바스!
en_us: the night cloud guild’s attack general gambas!

source: 반드시 살리고야 말겠네!
en_us: upon my word, I will save you!

source: 아까운 마나를
en_us: that’s a much better use of mana...

source: 대답 여하에 따라···.
en_us: depending on your answer...

source: 확실히 지불했다.
en_us: there, exactly seven.

source: 마나로 된 고문 도구인 아이언 메이든을 소환한다.
en_us: allows him to summon an iron maiden, a torture device made out of mana.

source: 다인 슬라이프.
en_us: dain sleif.

source: 사채없자
en_us: loan shark

source: 들썩
en_us: jiggle

source: 밤 구름 길드라면,
en_us: isn’t night cloud...

source: 그렇게 크게 휘두르면 어떡해?
en_us: you shouldn’t make your swings so big.

source: 앞으로 제대로 상납할게.
en_us: I’ll make sure to pay our dues on time from now on.

source: 기사단에게 감사의 인사를 받은 강철은 생각했다.
en_us: ...but hearing the knights thank him made him think...

source: 악
en_us: whoosh

source: 굉장한 물건을 만들어냈구나.
en_us: you’ve made something incredible.

source: 리저렉션!
en_us: resurrection!

source: 파{j}앙
en_us: {j}boom

source: 내 키메라를 망가트리지 마!
en_us: don’t break my chimera!

source: 그럼 이제 당신이 어떻게 될지도 잘 아시겠군요?
en_us: then you should know what’s going to happen to you, correct?

source: 역겨운 말만 골라서 하는 네놈은
en_us: every single word out of your mouth makes me sick.

source: 다 죽어가던 양반이 제자들 앞에서 폼 한 번 잡으려고 벌떡 일어나다니ꞏꞏꞏ.
en_us: he seriously jumped out of his deathbed to look good for his students...

source: 이대로 그냥 두면
en_us: if you leave us like this...

source: 확실히 말로만 떠드는 놈은 아니구나.
en_us: so you’re not just full of hot air.

source: 정복왕 쿠가.
en_us: ...kuga, king of conquest.

source: 쿠오
en_us: roar

source: 내 팔을 매개로 힘까지 훔치려 들어?
en_us: he used my arm as a medium to steal my power, too?

source: 우리 골드거든!!
en_us: we’re gold!!

source: 저요?
en_us: me?

source: 개소리!
en_us: what a load of crap!

source: 상가건물 전문
en_us: finest commercial buildings
